# 4번

## SQLalchemy 연결설정

In [75]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
from pandas import DataFrame

HOSTNAME = 'localhost'
PORT = 3306
USERNAME = 'root'
PASSWORD = 'root'
DATABASE = 'movie_contents'
CHARSET = 'utf8'

dbcon = pymysql.connect(host = HOSTNAME, port = PORT, user = USERNAME, password = PASSWORD,
                       db=DATABASE, charset = CHARSET)

## Mysql database 연결

In [76]:
con_str_fmt = 'mysql+mysqldb://{0}:{1}@{2}:{3}/{4}?charset={5}'
con_str = con_str_fmt.format(USERNAME, PASSWORD, HOSTNAME, PORT, DATABASE, CHARSET)
con_str

'mysql+mysqldb://root:root@localhost:3306/movie_contents?charset=utf8'

In [77]:
pymysql.install_as_MySQLdb()
import MySQLdb

engine = create_engine(con_str, encoding='utf-8')
conn = engine.connect()

## 4 - 1) to_sql 매서드를 이용하여 데이터베이스에 데이터 저장

In [78]:
cursor = dbcon.cursor()

def insert_table(df, table, idx_bool):
    df.to_sql(name=table, con=conn, if_exists='append', index=idx_bool)
    
movies = {
    'movie_code_no' : [20345165,15245775,21254235,19245478,20512024],
    'title' : ['영화1', '영화2','영화3','영화4','영화5'],
    'year' : [2017,2015,2020,2019,2016],
    'country' : ['Korea','Korea','USA','Japan','Korea'],
    'running_time' : ['02:14:06','01:50:12','02:00:30','01:40:12','01:55:52'],
    'release_date' : ['2020-04-14','2019-04-20','2021-11-20','2021-01-05','2018-05-25'],
    'production' : ['CJ E&M', '광화문시네마', '와인스틴 컴퍼니', '토에이', '외유내강'],
    'present' : ['CJ엔터테인먼트','쇼박스','워너 브라더스','토에이', 'NEW']

}

producers = {
    'reg_no' : [20354651,20245515,10524325,14521543,16245845],
    'name' : ['김감독', '나감독', '박감독', '이감독', '명감독'],
    'gender' : ['M', 'W', 'M', 'W', 'M'],
    'birth_date' : ['1967-06-17', '1975-11-02', '1972-04-16', '1971-08-12','1988-01-12'],
    'birth_country' : ['Korea', 'Korea','USA','UK','Korea'],
    'education' : ['대졸', '대졸', '고졸', '고졸', '석사']
}

actors = {
    'actor_no' : [20354651,20457863,10524325,17846326,19865324],
    'birth_date' : ['1967-06-17', '1994-05-02', '1972-04-16', '1999-10-10','1988-06-30'],
    'name' : ['김감독', '나배우', '박감독', '이배우', '명배우'],
    'gender' : ['M', 'W', 'M', 'W', 'M'],
    'birth_country' : ['Korea', 'Japan', 'USA', 'Korea', 'Korea'],
    'height' : [175,160,172,159,183],
    'weight' : [80,50,69,42,78],
    'blood_type' : ['O','A','B','AB','O']
}

movies_has_producers = {
   'movies_movie_code_no' : [20345165,20345165,15245775,15245775,21254235,19245478,20512024],
    'producers_reg_no' : [20354651,20245515,10524325,16245845,14521543,16245845,20354651]
}

movies_has_actors = {
    'movies_movie_code_no' : [20345165,20345165,20345165,15245775,15245775,21254235,19245478,19245478,20512024,20512024,20512024],
    'actors_actor_no' : [20457863,19865324,20354651,20457863,17846326,17846326,19865324,10524325,17846326,20354651,20457863]
}

insert_table(DataFrame(movies), 'movies', False)
insert_table(DataFrame(producers), 'producers', False)
insert_table(DataFrame(actors), 'actors', False)
insert_table(DataFrame(movies_has_actors), 'movies_has_actors', False)
insert_table(DataFrame(movies_has_producers), 'movies_has_producers', False)

## 4-2) 2020년에 제작된 영화의 제목, 제작국가, 상영시간, 제작사

In [79]:
sql = 'SELECT title, country, running_time,production FROM movies WHERE year = 2020'
df = pd.read_sql(sql, con=conn)
df

  title country    running_time production
0   영화3     USA 0 days 02:00:30   와인스틴 컴퍼니

## 4-3)최근 3년 이내 제작된 영화의 제목,제작국가,개봉일,제작사 배급사

In [80]:
import datetime as dt

now_year = dt.datetime.now().year

sql = 'SELECT title, country, running_time, release_date, production, present FROM movies WHERE year >= %s' % (now_year - 3)
df = pd.read_sql(sql, con=conn)
df

  title country    running_time release_date production  present
0   영화4   Japan 0 days 01:40:12   2021-01-05        토에이      토에이
1   영화3     USA 0 days 02:00:30   2021-11-20   와인스틴 컴퍼니  워너 브라더스

## 4-4)이름이 ‘명감독’인 감독이 촬영한 영화의 제목
<b> 서브쿼리 사용 </b>

In [70]:
sql = '''
SELECT title 
FROM movies 
WHERE movie_code_no IN (
    SELECT movies_movie_code_no 
    FROM movies_has_producers 
    WHERE producers_reg_no = (
        SELECT reg_no 
        FROM producers WHERE name = "명감독"
        )
    )
    '''

df = pd.read_sql(sql, con=conn)
df

  title
0   영화2
1   영화4

## 4-5)감독이 직접 배우로 출현한 영화의 제목과, 제작국가, 상영시간을 데이터 마트로 구현하시오. (이름과 생년월일이 같으면 동일인으로 인정)

<b> 감독의 등록코드와 배우의 배우번호는 고유한 값이기 때문에, 두개의 값이 서로 같으면 동일인으로 생각했다.</b><br><b> 조인 사용 </b>

In [71]:
sql = '''
SELECT title,country,running_time
FROM movies, movies_has_actors, movies_has_producers 
WHERE movie_code_no = movies_has_actors.movies_movie_code_no 
AND movie_code_no = movies_has_producers.movies_movie_code_no 
AND actors_actor_no = producers_reg_no
'''

df = pd.read_sql(sql, con=conn)
df

  title country    running_time
0   영화1   Korea 0 days 02:14:06
1   영화5   Korea 0 days 01:55:52

## 4-6)제작한 영화가 2편 이상인 감독의 등록번호, 이름, 성별, 생년월일
<b> Grouy by 절과 서브쿼리 사용 </b>

In [72]:
sql = '''
SELECT reg_no, name, gender, birth_date 
FROM producers
WHERE reg_no 
IN (
    SELECT producers_reg_no 
    FROM movies_has_producers 
    GROUP BY producers_reg_no 
    HAVING count(producers_reg_no) >= 2
    )
    '''

df = pd.read_sql(sql, con=conn)
df

     reg_no name gender  birth_date
0  16245845  명감독      M  1988-01-12
1  20354651  김감독      M  1967-06-17

In [73]:
conn.close()